<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest LogMeIn installer and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.rbreslow.autopkg-recipes.munki.logmein</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LogMeIn</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>DEPLOY_ID</key>
        <string></string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Access &amp; manage computers remotely.</string>
            <key>minimum_os_version</key>
            <string>10.9</string>
            <key>display_name</key>
            <string>LogMeIn</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rbreslow.autopkg-recipes.pkg.logmein</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
